#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:nil e:t
#+options: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t tags:t
#+options: tasks:t tex:t timestamp:t title:t toc:nil todo:t |:t
#+title: Diary of a Vagrant
#+subtitle: Experiments on virtualization and self-learning Vagrant & Friends.
#+date: <2020-11-24 mar>
#+author: Ezequiel Birman
#+email: ebirman77@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 27.1 (Org mode 9.4)

I'll try to install Vagrant and most provider backendslike VirtualBox, libvirt,
VMware, etc. Then I'll download some boxes to test, maybe also bechnmark and
learn about them. My current computer runs Fedora 33, so many of the steps I'll
detail will apply to similar distributions without changes.

*** Currently installed plugins
:PROPERTIES:
:CREATED:  [2020-12-30 mié 13:51]
:END:
To get a list of currently installed plugins run:
#+begin_src sh :async :exports both :results raw list
vagrant plugin list
#+end_src

#+RESULTS:
- vagrant-cachier (1.2.1, global)
- vagrant-libvirt (0.3.0, global)

